In [4]:
pwd

'/Users/alexrosheim/Desktop/UDENDATA_ACR/04-Pandas Homework_ACR/PyCitySchools'

In [5]:
import pandas as pd
import numpy as np

In [7]:
school_df = pd.read_csv("Resources/schools_complete.csv")
student_df = pd.read_csv("Resources/students_complete.csv")

In [8]:
# District Summary

# * Create a high level snapshot (in table form) of the district's key metrics, including:
#   * Total Schools school name unique
#   * Total Students sum of size
#   * Total Budget sum of budget
#   * Average Math Score math score, mean
#   * Average Reading Score reading score, mean
#   * % Passing Math (bin to passing, non passing)
#   * % Passing Reading (bin to passing, non passing)
#   * Overall Passing Rate (Average of the above two)

In [10]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [39]:
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [67]:
total_schools = school_df['school_name'].unique().size
school_df['Total Schools'] = total_schools

In [68]:
total_students = school_df['size'].sum()
school_df['Total Students'] = total_students

In [71]:
total_budget = school_df['budget'].sum()
school_df['Total Budget'] = "${0:.2f}".format(total_budget)

In [122]:
school_df.head()

,School ID,school_name,type,size,budget,Total Schools,Total Students,Total Budget
0,0,Huang High School,District,2917,1910635,15,39170,$24649428.00
1,1,Figueroa High School,District,2949,1884411,15,39170,$24649428.00
2,2,Shelton High School,Charter,1761,1056600,15,39170,$24649428.00
3,3,Hernandez High School,District,4635,3022020,15,39170,$24649428.00
4,4,Griffin High School,Charter,1468,917500,15,39170,$24649428.00

In [57]:
student_df.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61

In [73]:
avg_math = student_df['math_score'].mean()
student_df['Avg Math Score'] = avg_math

In [74]:
avg_reading = student_df['reading_score'].mean()
student_df['Avg Reading Score'] = avg_reading

In [75]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Avg Math Score,Avg Reading Score
0,0,Paul Bradley,M,9th,Huang High School,66,79,78.985371,81.87784
1,1,Victor Smith,M,12th,Huang High School,94,61,78.985371,81.87784
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,78.985371,81.87784
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,78.985371,81.87784
4,4,Bonnie Ray,F,9th,Huang High School,97,84,78.985371,81.87784

In [145]:
bins = [0, 69, 100]
group_names = ["Not Passing Grade", "Passing Grade"]
student_df["Pct Passing Math"] = pd.cut(student_df["math_score"], bins, labels=group_names)

In [146]:
bins = [0, 69, 100]
group_names = ["Not Passing Grade", "Passing Grade"]
student_df["Pct Passing Reading"] = pd.cut(student_df["reading_score"], bins, labels=group_names)

In [147]:
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,Avg Math Score,Avg Reading Score,Pct Passing Math,Pct Passing Reading
0,0,Paul Bradley,M,9th,Huang High School,66,79,78.985371,81.87784,Passing Grade,Not Passing Grade
1,1,Victor Smith,M,12th,Huang High School,94,61,78.985371,81.87784,Not Passing Grade,Passing Grade
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,78.985371,81.87784,Not Passing Grade,Passing Grade
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,78.985371,81.87784,Not Passing Grade,Not Passing Grade
4,4,Bonnie Ray,F,9th,Huang High School,97,84,78.985371,81.87784,Passing Grade,Passing Grade

In [148]:
student_df['Pct Passing Math'].value_counts(normalize=True)

Passing Grade        0.749809
Not Passing Grade    0.250191
Name: Pct Passing Math, dtype: float64

In [149]:
student_df['Pct Passing Reading'].value_counts(normalize=True)

Passing Grade        0.858055
Not Passing Grade    0.141945
Name: Pct Passing Reading, dtype: float64

In [ ]:
#take out passing percentage(s)?

In [ ]:
#find avg of the two passing percentages?

In [94]:
school_df.head()

,School ID,school_name,type,size,budget,Total Schools,Total Students,Total Budget
0,0,Huang High School,District,2917,1910635,15,39170,$24649428.00
1,1,Figueroa High School,District,2949,1884411,15,39170,$24649428.00
2,2,Shelton High School,Charter,1761,1056600,15,39170,$24649428.00
3,3,Hernandez High School,District,4635,3022020,15,39170,$24649428.00
4,4,Griffin High School,Charter,1468,917500,15,39170,$24649428.00

In [93]:
# * Create an overview table that summarizes key metrics about each school, including:
#   * School Name
#   * School Type
#   * Total Students
#   * Total School Budget
#   * Per Student Budget
#   * Average Math Score
#   * Average Reading Score
#   * % Passing Math
#   * % Passing Reading
#   * Overall Passing Rate (Average of the above two)

In [141]:
# list(school_df.groupby('school_name')['school_name', 'type', 'size', 'budget'])

school_metrics = school_df[['school_name', 'type', 'size', 'budget']]

In [144]:
school_metrics.head(2)

            school_name      type  size   budget
0     Huang High School  District  2917  1910635
1  Figueroa High School  District  2949  1884411

In [154]:
school_metrics['Per Student Budget'] = school_metrics[('budget') / float('size')]

ValueError: could not convert string to float: 'budget'